#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

int main() {
    int a = 1, b = 2, c = 3, d = 4;
    printf("%d\n", a + b * c - d);

    // 1、小括号优先级最高，如果记不住，多加小括号
    a || ~b && c++ == d - 2 * a > 7;
    // (a || ~b) && (c++ == (d - 2 * a > 7) );

    // 2、一元 > 二元 > 三元    !、~   >  &&、||  >  ?:
    !a || !b;  // (!a) || (!b);

    // 3、算术 > 关系 > 逻辑
    a * 2 - b < c && c * 4 - d * 3 == 0;
    // (a * 2 - b < c) && (c * 4 - d * 3 == 0);
    // (a * 2 - b) < c
    // (c * 4 - d * 3) == 0

    // 4、! > && > ||
    !a || !b && c;
    // !a || (!b && c)

    // 5、逗号最低、赋值次之
    a = 4, b = a = 4, b = 5, c = 6;
    // (a = 4), (b = a = 4), (b = 5), (c = 6);

    return 0;
}
