#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/*
x & y            读作  x位与y

左操作数     右操作数      结果
   0            0            0
   0            1            0
   1            0            0
   1            1            1

结论：
1、无论是0或1，只要位与上1，结果还是它本身
2、无论是0或1，只要位与上0，结果就是0
*/


int main() {
    // 1、位与运算的含义
    int a = 0b1010;
    int b = 0b0110;
    //     ------------
    //      0b0010;     
    printf("%d\n", (a & b) );

    // 2、奇偶性判定
    printf("%d\n", 0 & 1);
    printf("%d\n", 2 & 1);
    printf("%d\n", 4 & 1);
    printf("%d\n", 6 & 1);

    printf("%d\n", 1 & 1);
    printf("%d\n", 3 & 1);
    printf("%d\n", 5 & 1);
    printf("%d\n", 7 & 1);

    //    0b111
    //    0b001   &
    //    ----------
    //    0b001 

    // 3、取一个数二进制的低四位
    int y = 0b1010100101;
    int k = 0b0000001111;
    printf("%d %d\n", (y & k), 0b0101);

    // 4、把一个数二进制末尾连续的1变成0
    int z = 0b10100111111;
    //z+1 = 0b10101000000;
    //      0b10100000000;
    printf("%d %d\n", z&(z+1), 0b10100000000);

    return 0;
}
